testdata/IN_2023_02/Roundtrip/produkt/zusatz/avmg/20140417_grundlage_pro_jahr_2023_02b.xml_request_2023_02b.xml

<?xml version="1.0" encoding="UTF-8" standalone="no"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
  <soapenv:Body>
    <tarif:getQuote xmlns:allg="http://www.bipro.net/namespace/allgemein" xmlns:basis="http://www.bipro.net/namespace/basis" xmlns:dt="http://www.bipro.net/namespace/datentypen" xmlns:gevo="http://www.bipro.net/namespace/gevo" xmlns:nachr="http://www.bipro.net/namespace/nachrichten" xmlns:partner="http://www.bipro.net/namespace/partner" xmlns:pm="http://www.bipro.net/namespace/produktmodell" xmlns:pm-leben="http://www.bipro.net/namespace/versicherung/produktmodell/leben" xmlns:tarif="http://www.bipro.net/namespace/versicherung/tarifierung" xmlns:vbl="urn:de:vb:bipro:taa:leben:1.12" xmlns:vs-pm="http://www.bipro.net/namespace/versicherung/produktmodell" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
          
      <tarif:Request>
                
        <nachr:BiPROVersion>2.4.6.1.12</nachr:BiPROVersion>
        <nachr:ConsumerID>WS DEV TEAM</nachr:ConsumerID>
                
        <tarif:Tarifierung>
                    
          <tarif:Partner xsi:type="partner:CT_Person">
                        
            <partner:Anrede>2</partner:Anrede>
                        
            <partner:PartnerID>1</partner:PartnerID>
                        
            <partner:Geburtsdatum>1992-11-01</partner:Geburtsdatum>
              
            
            <partner:Geschlecht>2</partner:Geschlecht>
                        
            <partner:Berufstaetigkeit>
                            
              <partner:Beruf>Maler- u. Lackierermeisterin</partner:Beruf>
                            
              <partner:StellungImBeruf xsi:type="dt:STE_StellungImBerufBasis">01</partner:StellungImBeruf>
                          
            </partner:Berufstaetigkeit>
                      
          </tarif:Partner>
                    
          <tarif:Versicherungsnehmer>
                        
            <partner:PartnerID>1</partner:PartnerID>
                      
          </tarif:Versicherungsnehmer>
                    
          <tarif:Verkaufsprodukt>
                        
            <pm:Produkt xsi:type="pm-leben:CT_Produkt">
                            
              <basis:Erweiterung xsi:type="vbl:CT_ProduktErweiterung">
                                
                <vbl:Tarifgruppe>Honorar</vbl:Tarifgruppe>
                              
              </basis:Erweiterung>
                            
              <pm:GewuenschteZahlungsweise>2</pm:GewuenschteZahlungsweise>
                            
              <pm:Beitrag>
                                
                <pm:ArtID xsi:type="dt:STE_BeitragBasis">01</pm:ArtID>
                                
                <pm:Betrag>
                                    
                  <allg:Betrag>923.0</allg:Betrag>
                                    
                  <allg:Waehrung>EUR</allg:Waehrung>
                                  
                </pm:Betrag>
                                
                <pm:Zahlungsweise>2</pm:Zahlungsweise>
                              
              </pm:Beitrag>
                            
              <pm:Beitrag>
                                
                <pm:ArtID xsi:type="dt:STE_BeitragBasis">01</pm:ArtID>
                                
                <pm:Betrag>
                                    
                  <allg:Betrag>233.0</allg:Betrag>
                                    
                  <allg:Waehrung>EUR</allg:Waehrung>
                                  
                </pm:Betrag>
                                
                <pm:Zahlungsweise>6</pm:Zahlungsweise>
                              
              </pm:Beitrag>
                            
              <pm:Versicherungsdauer>
                                  
                <allg:Beginn>2023-03-01T12:00</allg:Beginn>
                 
              
              </pm:Versicherungsdauer>
                            
              <pm:Kennung>AIR</pm:Kennung>
                            
              <pm:Elementarprodukt xsi:type="pm-leben:CT_ZulagenRente">
                                
                <basis:Erweiterung xsi:type="vbl:CT_RenteErweiterung">
                                    
                  <vbl:TodesfallleistungImBezug>IndividuelleGarantiezeit</vbl:TodesfallleistungImBezug>
                                  
                </basis:Erweiterung>
                                
                <pm:Beitrag>
                                    
                  <pm:ArtID xsi:type="vbl:STE_BeitragErweitert">Eigenanteil</pm:ArtID>
                                    
                  <pm:Betrag>
                                        
                    <allg:Betrag>1846.0</allg:Betrag>
                                        
                    <allg:Waehrung>EUR</allg:Waehrung>
                                      
                  </pm:Betrag>
                                    
                  <pm:Zahlungsweise>1</pm:Zahlungsweise>
                                  
                </pm:Beitrag>
                                
                <pm:Versicherungsdauer>
                                    
                  <allg:AnzahlJahre>35</allg:AnzahlJahre>
                                  
                </pm:Versicherungsdauer>
                                
                <pm:Dynamik>
                                    
                  <basis:Erweiterung xsi:type="vbl:CT_DynamikErweiterung">
                                        
                    <vbl:Art>TodesUndErlebensfall</vbl:Art>
                                      
                  </basis:Erweiterung>
                                    
                  <pm:ArtID xsi:type="dt:STE_DynamikBasis">05</pm:ArtID>
                                    
                  <pm:Frequenz xsi:type="dt:STE_FrequenzBasis">jaehrlich</pm:Frequenz>
                                    
                  <pm:KategorieID>Beitrag</pm:KategorieID>
                                  
                </pm:Dynamik>
                                
                <vs-pm:VersicherungssummeOderLeistung>
                                    
                  <vs-pm:ArtID xsi:type="dt:STE_VersicherungssummeOderLeistungBasis">GarantierteRente</vs-pm:ArtID>
                                    
                  <vs-pm:Wertschluessel xsi:type="vbl:STE_LeistungSchluesselErweitert">Klassisch</vs-pm:Wertschluessel>
                                  
                </vs-pm:VersicherungssummeOderLeistung>
                                
                <pm-leben:IstHauptversicherung>true</pm-leben:IstHauptversicherung>
                                
                <pm-leben:UeberschussverwendungVorLeistung xsi:type="dt:STE_UeberschussverwendungBasis">12</pm-leben:UeberschussverwendungVorLeistung>
                                
                <pm-leben:VersichertePerson>
                                    
                  <partner:PartnerID>1</partner:PartnerID>
                                  
                </pm-leben:VersichertePerson>
                                
                <pm-leben:Garantiezeit>
                                    
                  <allg:AnzahlJahre>4</allg:AnzahlJahre>
                                  
                </pm-leben:Garantiezeit>
                                
                <pm-leben:ZulagenDaten>
                                    
                  <basis:Erweiterung xsi:type="vbl:CT_ZulagenDatenErweiterung">
                                        
                    <vbl:AltersvorsorgewirksameLeistungen>false</vbl:AltersvorsorgewirksameLeistungen>
                                        
                    <vbl:Familienstand>OhneNichtSelbstBerechtigtenPartner</vbl:Familienstand>
                                        
                    <vbl:Antragsdaten>
                                            
                      <vbl:BesondererPersonenkreis>false</vbl:BesondererPersonenkreis>
                                            
                      <vbl:AuslaendischeBeschaeftigung>false</vbl:AuslaendischeBeschaeftigung>
                                            
                      <vbl:OhneDauerzulagenantrag>false</vbl:OhneDauerzulagenantrag>
                                          
                    </vbl:Antragsdaten>
                                      
                  </basis:Erweiterung>
                                    
                  <pm-leben:Foerderungsberechtigung>selbst</pm-leben:Foerderungsberechtigung>
                                    
                  <pm-leben:EinkommenVorjahr>50000.0</pm-leben:EinkommenVorjahr>
                                    
                  <pm-leben:Eigenbeitragsart>min</pm-leben:Eigenbeitragsart>
                                  
                </pm-leben:ZulagenDaten>
                              
              </pm:Elementarprodukt>
                            
              <pm:Elementarprodukt xsi:type="pm-leben:CT_ArbeitskraftAbsicherung">
                                
                <pm-leben:IstHauptversicherung>false</pm-leben:IstHauptversicherung>
                                
                <pm-leben:VersichertePerson>
                                    
                  <partner:PartnerID>1</partner:PartnerID>
                                  
                </pm-leben:VersichertePerson>
                                
                <pm-leben:Art xsi:type="vbl:STE_UnfaehigkeitsZusatzArtErweitert">BeitragsbefreiungMitVereinfachterGesundheitspruefung</pm-leben:Art>
                                
                <pm-leben:Auspraegung xsi:type="dt:STE_UnfaehigkeitsZusatzAuspraegungBasis">BU</pm-leben:Auspraegung>
                                
                <pm-leben:DynamisierungDerHauptversicherungImLeistungsfall>false</pm-leben:DynamisierungDerHauptversicherungImLeistungsfall>
                              
              </pm:Elementarprodukt>
                            
              <pm-leben:VorgabeBerechnung>
                                
                <pm-leben:ArtID xsi:type="dt:STE_VorgabeBerechnungBasis">Bruttobeitrag</pm-leben:ArtID>
                                
                <pm-leben:Kontext xsi:type="dt:STE_VorgabeBerechnungKontextBasis">Produkt</pm-leben:Kontext>
                              
              </pm-leben:VorgabeBerechnung>
                          
            </pm:Produkt>
                      
          </tarif:Verkaufsprodukt>
                  
        </tarif:Tarifierung>
              
      </tarif:Request>
      
    </tarif:getQuote>
  </soapenv:Body>
</soapenv:Envelope>
